# DimIsreporting Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DimIsreporting Property
ParameterTypeId Class See Also
---
"Is Reporting"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DimIsreporting { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DimIsreporting As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DimIsreporting {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace